<a href="https://colab.research.google.com/github/dohyeon-kim012/python-1./blob/main/5_21(%EC%8B%9C%EA%B0%81%ED%99%941).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

덕 타이핑  Docstring

In [1]:
def Disp(name='장정자', age=60):
    '''
    Disp 함수는 이름과 나이를 출력함
    '''
    print(name, age)

위와 같이 메모를 하고 DIsp() 를 타이핑해보면 필요한 내용들이 바로 메모 창으로 보임

In [2]:
Disp()

장정자 60

In [3]:
Disp(name='김도도', age=28)

김도도 28

In [4]:
Disp?   
'''
Signature: Disp(name='장정자', age=60)
Docstring: Disp 함수는 이름과 나이를 출력함
File:      /content/<ipython-input-1-2f8ff1d2fd7a>
Type:      function
'''

In [5]:
Disp??
'''
Signature: Disp(name='장정자', age=60)
Source:   
def Disp(name='장정자', age=60):
    
    Disp 함수는 이름과 나이를 출력함
    
    print(name, age)
File:      /content/<ipython-input-1-2f8ff1d2fd7a>
Type:      function
'''

In [6]:
import numpy as np
import pandas as pd
n1 = np.arange(1, 11, 2)
type(n1)

numpy.ndarray

In [7]:
a = [1, 2, 3, 4, 5]
a

[1, 2, 3, 4, 5]

In [8]:
*a

SyntaxError: ignored

In [9]:
a1, a2, a3, a4, a5 = a    #pack, unpack과 비슷한 개념
a2

2

In [10]:
a1, a2, *a3 = a
a1, a2, a3   #list 형태로 a3에 들어가게됨

(1, 2, [3, 4, 5])

In [11]:
d1 = {'name':'만수','age':25,'job':'white hand'}    # dict 만들기
type(d1)

dict

In [12]:
d100 = pd.DataFrame(d1, index=[1,2])    # dict로 dataframe 만들 수 있다
d100

  name  age         job
1   만수   25  white hand
2   만수   25  white hand

제너레이터

In [13]:
ag = iter(a)
type(ag)    #iterator : iterable(연속적인)

list_iterator

In [14]:
sum(a)

15

In [15]:
sum(3, 56, 4)

TypeError: ignored

In [16]:
sum([3, 58, 4])    #연속적인 숫자들을 주거나, sum([3, 58, 4]) 처럼 한 번 더 괄호로 감싸야함

65

In [17]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [18]:
!df -h

Filesystem      Size  Used Avail Use% Mounted on
overlay         108G   39G   70G  36% /
tmpfs            64M     0   64M   0% /dev
tmpfs           6.4G     0  6.4G   0% /sys/fs/cgroup
shm             5.9G     0  5.9G   0% /dev/shm
tmpfs           6.4G   24K  6.4G   1% /var/colab
/dev/sda1       114G   41G   74G  36% /etc/hosts
tmpfs           6.4G     0  6.4G   0% /proc/acpi
tmpfs           6.4G     0  6.4G   0% /proc/scsi
tmpfs           6.4G     0  6.4G   0% /sys/firmware
drive            15G  1.2G   14G   8% /content/drive

In [19]:
aa = np.array(a)
type(a), type(aa)

(list, numpy.ndarray)

In [20]:
aa + 5   # broadcasting

array([ 6,  7,  8,  9, 10])

In [21]:
a + [5, 5, 5]

[1, 2, 3, 4, 5, 5, 5, 5]

수의 표현 방식
1) 부호와 절대 값
2) 1의 보수
3) 2의 보수



---

### 오후 수업

In [22]:
import pandas as pd
import numpy as np
df = pd.read_csv('/content/drive/MyDrive/pydata-book-2nd-edition/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
df = pd.read_table('/content/drive/MyDrive/pydata-book-2nd-edition/examples/ex1.csv', sep=',')
df     # csv로 읽어올 수도 있고, table에 sep 구분자 쉼표로 지정하여 읽어올 수도 있음

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
result= pd.read_table('/content/drive/MyDrive/pydata-book-2nd-edition/examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [29]:
import sys               # stdout: 표준출력장치(모니터)
df.to_csv(sys.stdout)    # 읽을 때는 read_ , 저장할 때는 to_ 쓰면됨

,a,b,c,d,message
0,1,2,3,4,hello
1,5,6,7,8,world
2,9,10,11,12,foo

In [33]:
df.to_csv('myout.csv')
!ls

drive  myout.csv  sample_data

In [31]:
!cat -n myout.csv

     1	,a,b,c,d,message
     2	0,1,2,3,4,hello
     3	1,5,6,7,8,world
     4	2,9,10,11,12,foo

In [35]:
def f(x):
    return x*x

In [36]:
list(map(f, [1, 2, 3, 4]))

[1, 4, 9, 16]

In [37]:
list(map(int, input().split()))    # 문자열만 입력받는 input으로 입력받는 데이터를 전부 정수로 받겠다는 의미
## map 함수 안에 들어있는 또 다른 함수 int: 콜백함수, input()은 iterable

Serverfarm

ValueError: ignored

In [39]:
k = [1, 2, 3, 4, 5]
list(map(f,k))    # f는 함수명, k는 list/tuple

[1, 4, 9, 16, 25]

### 시각화 초반

In [42]:
d1 = pd.DataFrame({'name' : ['이순신', '황진이', '신돌석', '유관순'],
                  'job': ['공무원', '시인', '골목대장', '독립운동가']})

d2 = pd.DataFrame({'p_name' : ['이순신', '황진이', '이순신', '유관순'],
                  'project': ['A', 'A', 'B', 'C']})

d1

  name    job
0  이순신    공무원
1  황진이     시인
2  신돌석   골목대장
3  유관순  독립운동가

In [43]:
d2

  p_name project
0    이순신       A
1    황진이       A
2    이순신       B
3    유관순       C

In [45]:
pd.merge(d1, d2, how='outer', left_on='name', right_on='p_name').drop('name', axis=1)  
#왼쪽,오른쪽 column명 정하고, name column은 중복되지 않도록 삭제
#how='outer'로 골목대장 행 추가함(NaN값 포함됨)

     job p_name project
0    공무원    이순신       A
1    공무원    이순신       B
2     시인    황진이       A
3   골목대장    NaN     NaN
4  독립운동가    유관순       C

In [47]:
print(d1,'\n\n' ,d2)

  name    job
0  이순신    공무원
1  황진이     시인
2  신돌석   골목대장
3  유관순  독립운동가

   p_name project
0    이순신       A
1    황진이       A
2    이순신       B
3    유관순       C